In [1]:
import pandas as pd

## DataFrame 관련 자료모음
- [How to create empty DataFrame with column names](https://kite.com/python/answers/how-to-create-an-empty-dataframe-with-column-names-in-python)
- [How to insert a row into a Pandas DataFrame](https://kite.com/python/answers/how-to-insert-a-row-into-a-pandas-dataframe)
- [insert 함수 이용하기](https://jaeyung1001.tistory.com/69)

## 참고할만한 자료들
- https://nittaku.tistory.com/110
- https://kite.com/python/answers/how-to-create-an-empty-dataframe-with-column-names-in-python
- https://www.geeksforgeeks.org/python-pandas-series/
- https://pinkwink.kr/734

In [2]:
fake_data = [
    {'id': 0, 'name': 'Alan'},
    {'id': 1, 'name':'Bert'},
    {'id': 2, 'name':'Cat'},
    {'id': 3, 'name':'Dez'},
    {'id': 4, 'name':'Eli'},
    {'id': 5, 'name':'Flo'}
]

In [3]:
new_df = pd.DataFrame(fake_data)

In [22]:
new_df.iloc[1:]['name']

1    Bert
2     Cat
3     Dez
4     Eli
5     Flo
Name: name, dtype: object

In [4]:
data = new_df.set_index('id')[3:].copy(deep=True)

In [5]:
for i, row in new_df.iterrows():
    print(type(row))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [6]:
for i, row in new_df.iterrows():
    new_df.append(row)

# 새로운 row를 Series 타입으로 만들어 append 하기

In [7]:
series1 = pd.Series([39, 'Kyle'], index=['id', 'name'])
series1

id        39
name    Kyle
dtype: object

In [13]:
series1.array

<PandasArray>
[39, 'Kyle']
Length: 2, dtype: object

In [8]:
new_df.append(series1, ignore_index=True)

   id  name
0   0  Alan
1   1  Bert
2   2   Cat
3   3   Dez
4   4   Eli
5   5   Flo
6  39  Kyle

In [9]:
for i, row in new_df.iterrows():
    print(type(row))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

# 행 3개 복제

In [10]:
for index, row in new_df.iterrows():
    data_name = row['name']
#     print(data_name)
    for i in range(3):
        series_temp = pd.Series(row, index=['id', 'name'])
        new_df.append(series_temp, ignore_index=True)

In [11]:
new_df

   id  name
0   0  Alan
1   1  Bert
2   2   Cat
3   3   Dez
4   4   Eli
5   5   Flo

In [12]:
for i in range(3):
    print(i+1)

1
2
3

In [29]:
a_row = pd.Series([1,2]) # df_as_row
df_a = pd.DataFrame([[3,4], [5,6]]) # df_alternative

In [30]:
row_insert = pd.DataFrame([a_row])
df_a = pd.concat([row_insert, df_a], ignore_index=True)
df_a

   0  1
0  1  2
1  3  4
2  5  6